src/Documents/ИТСервисы_ПланТиражированияСервиса/ИТСервисы_ПланТиражированияСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ПланТиражированияСервиса</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПлана</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыПодключения</name>
    <attributes>
      <name>ОрганизацияПолучатель</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗапуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйНаМесте</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>БюджетЭтапа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ИТСервисы_ПланТиражированияСервиса/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьИзКарточки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИТСервис) Тогда
		Сообщить("Сначала выберите ИТ-сервис!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИзКарточкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзКарточкиНаСервере()
	
	// Читаем данные из справочника ИТ-сервисы
	// (Предполагаем, что там осталась табличная часть ПрогнозПодключения)
	
	СервисСсылка = Объект.ИТСервис;
	
	// Запрос к ТЧ справочника
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Предприятие КАК ОрганизацияПолучатель,
		|	ТЧ.ДатаПрогноза КАК ДатаЗапуска
		|ИЗ
		|	Справочник.ИТСервисы_ИТСервисы.ПрогнозПодключения КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", СервисСсылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Сообщить("В карточке сервиса нет данных о прогнозе подключения.");
		Возврат;
	КонецЕсли;
	
	// Очищаем и заполняем
	Объект.ЭтапыПодключения.Очистить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.ЭтапыПодключения.Добавить();
		НовСтр.ОрганизацияПолучатель = Выборка.ОрганизацияПолучатель;
		НовСтр.ДатаЗапуска = Выборка.ДатаЗапуска;
		// Дата начала по умолчанию = за 3 месяца до запуска
		НовСтр.ДатаНачала = ДобавитьМесяц(Выборка.ДатаЗапуска, -3); 
	КонецЦикла;
	
КонецПроцедуры
